In [94]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as mlt
import seaborn as sns

## 누락데이터 처리

In [2]:
df= sns.load_dataset('titanic')
print(df.shape)
df.head()

(891, 15)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [4]:
df.deck.value_counts() #널값을 제외하고 나옴

C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: deck, dtype: int64

In [5]:
df['deck'].value_counts(dropna=False)

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [6]:
df.isnull().sum(axis=0)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [7]:
df1=df.dropna(axis=1,thresh=530)
df1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True

In [8]:
df1.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [15]:
df1.shape

(891, 14)

In [9]:
df_age=df.dropna(subset=['age'],how='any',axis=0)
print(df_age.shape)

(714, 15)

In [10]:
mean_age=df['age'].mean(axis=0)
df['age'].fillna(mean_age, inplace=True)

df['age'].head(10)
#df[['기존값','대체한값']]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: age, dtype: float64

In [11]:
x = df['embark_town'].value_counts(dropna=True).idxmax() # 가장 끝값을 찾아주는 메소드?
x

'Southampton'

In [12]:
df['embark_town'].fillna(x,inplace=True)

df['embark_town'].value_counts()

Southampton    646
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [13]:
df['embarked'].replace("-",np.nan,inplace=True)
df['embarked'].value_counts()

S    644
C    168
Q     77
Name: embarked, dtype: int64

In [14]:
df['embarked'][825:830]

825      Q
826      S
827      C
828      Q
829    NaN
Name: embarked, dtype: object

In [15]:
df['embarked'].fillna(method='ffill',inplace=True) # 828에 있는 q값을 829인 넌값을 q값으로 바뀜
df['embarked'][825:830]

825    Q
826    S
827    C
828    Q
829    Q
Name: embarked, dtype: object

# 중복 데이터 처리

In [16]:
df.duplicated().sum()

107

In [18]:
df['age'].duplicated().sum()

802

In [17]:
print(df1.shape)
df1.head()

(891, 14)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True

In [19]:
df3 = df1.drop_duplicates()
print(df3.shape)
df3.head()

(780, 14)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True

In [20]:
df4 = df.drop_duplicates(subset=['who','embarked'])
print(df4.shape)
df4.head()

(9, 15)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
5,0,3,male,29.699118,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
7,0,3,male,2.000000,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False

# 데이터 표준화

In [24]:
df= pd.read_csv('C:/Users/moonj/Downloads/auto-mpg.csv',header=0)
print(df.shape)
df.head()

(398, 9)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [25]:
df.columns=['mpg','cylinders','displacement','horsepower','weight','acceleration','model year','origin','car name']
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [26]:
df.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model year', 'origin', 'car name'],
      dtype='object')

In [27]:
# mile per gallon >> km/L

#1 마일당 1.6934km 이고 
#1 갤러은 3.758541 리터다
#따라서 1mpg = 0.425 km/L


mpg_to_kpl = 1.60934/3.78541
df['kpl']=df['mpg']*mpg_to_kpl

df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,kpl
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,7.652571
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320,6.377143
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite,7.652571
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst,6.802286
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino,7.227428

In [28]:
df['kpl']=df['kpl'].round(2) # 소수점 2개까지
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,kpl
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,7.65
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320,6.38
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite,7.65
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst,6.80
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino,7.23

In [29]:
# 미국 몸/ 무게 >> 우리나라 익숙한 단위로
# m >> km

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    398 non-null    object
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model year    398 non-null    int64
 7   origin        398 non-null    int64
 8   car name      398 non-null    object
 9   kpl           398 non-null    float64
dtypes: float64(4), int64(4), object(2)
memory usage: 31.2+ KB

In [31]:
df['horsepower'].unique()

array(['130', '165', '150', '140', '198', '220', '215', '225', '190',
       '170', '160', '95', '97', '85', '88', '46', '87', '90', '113',
       '200', '210', '193', '?', '100', '105', '175', '153', '180', '110',
       '72', '86', '70', '76', '65', '69', '60', '80', '54', '208', '155',
       '112', '92', '145', '137', '158', '167', '94', '107', '230', '49',
       '75', '91', '122', '67', '83', '78', '52', '61', '93', '148',
       '129', '96', '71', '98', '115', '53', '81', '79', '120', '152',
       '102', '108', '68', '58', '149', '89', '63', '48', '66', '139',
       '103', '125', '133', '138', '135', '142', '77', '62', '132', '84',
       '64', '74', '116', '82'], dtype=object)

In [32]:
df['horsepower'].replace('?', np.nan,inplace=True)
df['horsepower'].unique()

array(['130', '165', '150', '140', '198', '220', '215', '225', '190',
       '170', '160', '95', '97', '85', '88', '46', '87', '90', '113',
       '200', '210', '193', nan, '100', '105', '175', '153', '180', '110',
       '72', '86', '70', '76', '65', '69', '60', '80', '54', '208', '155',
       '112', '92', '145', '137', '158', '167', '94', '107', '230', '49',
       '75', '91', '122', '67', '83', '78', '52', '61', '93', '148',
       '129', '96', '71', '98', '115', '53', '81', '79', '120', '152',
       '102', '108', '68', '58', '149', '89', '63', '48', '66', '139',
       '103', '125', '133', '138', '135', '142', '77', '62', '132', '84',
       '64', '74', '116', '82'], dtype=object)

In [36]:
df['horsepower'].value_counts(dropna=False)

150    22
90     20
88     19
110    18
100    17
       ..
64      1
220     1
210     1
167     1
89      1
Name: horsepower, Length: 93, dtype: int64

In [34]:
df.dropna(subset=['horsepower'],axis=0,inplace=True)
df.shape

(392, 10)

In [37]:
df['horsepower']=df['horsepower'].astype('float')

df['horsepower'].dtypes

dtype('float64')

In [38]:
df['origin'].value_counts()

1    245
3     79
2     68
Name: origin, dtype: int64

In [40]:
df['origin'].replace({1:'USA',2:'EU',3:'JPN'},inplace=True)

print(df['origin'].unique())
print(df['origin'].dtypes)

['USA' 'JPN' 'EU']
object

In [41]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,kpl
0,18.0,8,307.0,130.0,3504,12.0,70,USA,chevrolet chevelle malibu,7.65
1,15.0,8,350.0,165.0,3693,11.5,70,USA,buick skylark 320,6.38
2,18.0,8,318.0,150.0,3436,11.0,70,USA,plymouth satellite,7.65
3,16.0,8,304.0,150.0,3433,12.0,70,USA,amc rebel sst,6.80
4,17.0,8,302.0,140.0,3449,10.5,70,USA,ford torino,7.23

In [42]:
df['origin']=df['origin'].astype('str')

df['origin'].dtypes

dtype('O')

In [44]:
df['origin']=df['origin'].astype('category')
df['origin'].dtypes

CategoricalDtype(categories=['EU', 'JPN', 'USA'], ordered=False)

In [45]:
df['model year'].value_counts()

73    40
78    36
76    34
82    30
75    30
79    29
70    29
81    28
77    28
72    28
80    27
71    27
74    26
Name: model year, dtype: int64

In [46]:
df['model year']=df['model year'].astype('category')
df['model year'].dtypes #타입 카테고리형 으로 바꾸기

CategoricalDtype(categories=[70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82], ordered=False)

# 구간분할 (binning)

In [47]:
df['horsepower'].value_counts()

150.0    22
90.0     20
88.0     19
110.0    18
100.0    17
         ..
94.0      1
167.0     1
158.0     1
137.0     1
107.0     1
Name: horsepower, Length: 93, dtype: int64

In [49]:
count, bind_dividers = np.histogram(df['horsepower'],bins=3)
print(bind_dividers)
#46~107.3 구간 / 107.3~ 168.6 구간 /168.6~230. 까지 구간 3개)

[ 46.         107.33333333 168.66666667 230.        ]

In [51]:
label_name=['저출력','보통출력','고출력']

df['hp_bin']=pd.cut(x=df['horsepower'],bins=bind_dividers,labels=label_name,include_lowest=True)

df[['horsepower','hp_bin']].head(20)

    horsepower hp_bin
0        130.0   보통출력
1        165.0   보통출력
2        150.0   보통출력
3        150.0   보통출력
4        140.0   보통출력
5        198.0    고출력
6        220.0    고출력
7        215.0    고출력
8        225.0    고출력
9        190.0    고출력
10       170.0    고출력
11       160.0   보통출력
12       150.0   보통출력
13       225.0    고출력
14        95.0    저출력
15        95.0    저출력
16        97.0    저출력
17        85.0    저출력
18        88.0    저출력
19        46.0    저출력

### 더미변수

In [53]:
horse_power = pd.get_dummies(df['hp_bin'])

horse_power.head(20)
#더미 속해있던 값은 1이되고 속해있지 않던 갓은 0으로 바뀜

    저출력  보통출력  고출력
0     0     1    0
1     0     1    0
2     0     1    0
3     0     1    0
4     0     1    0
5     0     0    1
6     0     0    1
7     0     0    1
8     0     0    1
9     0     0    1
10    0     0    1
11    0     1    0
12    0     1    0
13    0     0    1
14    1     0    0
15    1     0    0
16    1     0    0
17    1     0    0
18    1     0    0
19    1     0    0

## 정규화

* 값의 범위가 커서 편차가 적도록 만들기 위해 정규화를한다


* 각 열에 속하는 데이터 값을 동일한 크기 기준으로 나누는 비율 정규화(normalization)
* 정규화를 거친 데이터 범위는 0~1 또는 -1~1 사이의 범위를 갖는다.
* z-score ((x-mean)/std) : 데이터와 평균의 차를 표준편차로 나누어 준 값*# min-max scaler ((x-min/(max-min))) : 데이터와 가장 작은 값의 차를 가장 큰 값과 작은 값의 차이로 나누어 주는 것

In [54]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,kpl,hp_bin
0,18.0,8,307.0,130.0,3504,12.0,70,USA,chevrolet chevelle malibu,7.65,보통출력
1,15.0,8,350.0,165.0,3693,11.5,70,USA,buick skylark 320,6.38,보통출력
2,18.0,8,318.0,150.0,3436,11.0,70,USA,plymouth satellite,7.65,보통출력
3,16.0,8,304.0,150.0,3433,12.0,70,USA,amc rebel sst,6.80,보통출력
4,17.0,8,302.0,140.0,3449,10.5,70,USA,ford torino,7.23,보통출력

In [56]:
df.horsepower.describe()

count    392.000000
mean     104.469388
std       38.491160
min       46.000000
25%       75.000000
50%       93.500000
75%      126.000000
max      230.000000
Name: horsepower, dtype: float64

In [59]:
df.weight.describe()

count     392.000000
mean     2977.584184
std       849.402560
min      1613.000000
25%      2225.250000
50%      2803.500000
75%      3614.750000
max      5140.000000
Name: weight, dtype: float64

## min - max scaler

In [61]:
min_x=df.horsepower - df.horsepower.min()
min_max= df.horsepower.max()-df.horsepower.min()

df['horsepower_min_max']=min_x/min_max

df[['horsepower','horsepower_min_max']].head()

   horsepower  horsepower_min_max
0       130.0            0.456522
1       165.0            0.646739
2       150.0            0.565217
3       150.0            0.565217
4       140.0            0.510870

In [62]:
df.horsepower_min_max.describe() #데이터 범위를 확 줄여줌

count    392.000000
mean       0.317768
std        0.209191
min        0.000000
25%        0.157609
50%        0.258152
75%        0.434783
max        1.000000
Name: horsepower_min_max, dtype: float64

In [63]:
df['horsepower_zscore']=  (df.horsepower - df.horsepower. mean()) / df.horsepower.std()

df[['horsepower','horsepower_zscore']].head()

   horsepower  horsepower_zscore
0       130.0           0.663285
1       165.0           1.572585
2       150.0           1.182885
3       150.0           1.182885
4       140.0           0.923085

In [64]:
df['horsepower_zscore'].describe()

count    3.920000e+02
mean    -3.231542e-16
std      1.000000e+00
min     -1.519034e+00
25%     -7.656144e-01
50%     -2.849846e-01
75%      5.593651e-01
max      3.261284e+00
Name: horsepower_zscore, dtype: float64

In [67]:
df['horsepower_nomal'] = df.horsepower / abs(df.horsepower.max())

df[['horsepower','horsepower_nomal']].head()

   horsepower  horsepower_nomal
0       130.0          0.565217
1       165.0          0.717391
2       150.0          0.652174
3       150.0          0.652174
4       140.0          0.608696

In [68]:
df.horsepower_nomal.describe()

count    392.000000
mean       0.454215
std        0.167353
min        0.200000
25%        0.326087
50%        0.406522
75%        0.547826
max        1.000000
Name: horsepower_nomal, dtype: float64

# 시계열 데이터 (오류, 다른 페이지 볼 것)

In [84]:
df=pd.read_csv('C:/Users/moonj/Downloads/archive (1)/all_stocks_5yr.csv') 
print(df.shape)
df.head()

(619040, 7)

         date   open   high    low  close    volume Name
0  2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1  2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2  2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3  2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4  2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 619040 entries, 2013-02-08 to 2018-02-07
Data columns (total 6 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   open    619029 non-null  float64
 1   high    619032 non-null  float64
 2   low     619032 non-null  float64
 3   close   619040 non-null  float64
 4   volume  619040 non-null  int64
 5   Name    619040 non-null  object
dtypes: float64(4), int64(1), object(1)
memory usage: 33.1+ MB

In [125]:
df['new_date']=pd.to_datetime(df['date'])

df[['date','new_date']].head()

KeyError: 'date'

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 619040 entries, 0 to 619039
Data columns (total 8 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   date      619040 non-null  object
 1   open      619029 non-null  float64
 2   high      619032 non-null  float64
 3   low       619032 non-null  float64
 4   close     619040 non-null  float64
 5   volume    619040 non-null  int64
 6   Name      619040 non-null  object
 7   new_date  619040 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(4), int64(1), object(2)
memory usage: 37.8+ MB

In [100]:
df.head()

             open   high    low  close    volume Name
new_date
2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL

In [122]:
df.set_index('new_date', inplace=True)
df.drop('date',axis=1,inplace=True)

df.head()

             open   high    low  close    volume Name  year  month
new_date
2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL  2013      2
2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL  2013      2
2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL  2013      2
2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL  2013      2
2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL  2013      2

In [117]:
import datetime

df['new_date']=pd.to_datetime(df['date'])
df['year']=df['new_date'].dt.year

df.head()

         date   open   high    low  close    volume Name   new_date  year
0  2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL 2013-02-08  2013
1  2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL 2013-02-11  2013
2  2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL 2013-02-12  2013
3  2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL 2013-02-13  2013
4  2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL 2013-02-14  2013

In [119]:
df=pd.read_csv('C:/Users/moonj/Downloads/archive (1)/all_stocks_5yr.csv')
print(df1.shape)
df.head()

(619040, 7)

         date   open   high    low  close    volume Name
0  2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1  2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2  2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3  2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4  2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL

In [120]:
import datetime

df['new_date']=pd.to_datetime(df['date'])
df['year']=df['new_date'].dt.year

df.head()

         date   open   high    low  close    volume Name   new_date  year
0  2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL 2013-02-08  2013
1  2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL 2013-02-11  2013
2  2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL 2013-02-12  2013
3  2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL 2013-02-13  2013
4  2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL 2013-02-14  2013

In [121]:
df['month']=df['new_date'].dt.month
df[['new_date','month']].head()

    new_date  month
0 2013-02-08      2
1 2013-02-11      2
2 2013-02-12      2
3 2013-02-13      2
4 2013-02-14      2

In [124]:
df['day']=df['new_date'].dt.day
df[['new_date','day']].head()

KeyError: 'new_date'

In [123]:
df['Date_year']= df['new_date'].dt.to_period(freq='A')
df.head()

KeyError: 'new_date'